<!-- dflook/terraform-github-actions {"workspace":"refresh-2","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"36195028186828270246d45c3fd0368519d41a9f3a84d3d327d9f2c0725a168e","plan_job_ref":"Job Test actions using target and replace #469 at https://github.com/dflook/terraform-github-actions/actions/runs/14040972099","plan_hash":"2b368fb371eea4e77c6ae2c93a0e3386feffe8aa7e3ca10cdb16d584709b2c01","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __refresh-2__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "VEJZhjwYo0" -> (known after apply)
!~  foreach = "VThhO2oxs1" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #469](https://github.com/dflook/terraform-github-actions/actions/runs/14040972099)